; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-6-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-3 - location
	p1-0 - location
	p2-3 - location
	p2-4 - location
	p3-1 - location
	p4-2 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s0)
	(at driver3 s3)
	(at driver4 s2)
	(at driver5 s2)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at truck6 s2)
	(empty truck6)
	(at package1 s4)
	(at package2 s0)
	(at package3 s4)
	(at package4 s1)
	(at package5 s3)
	(at package6 s4)
	(at package7 s1)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 49)
	(= (time-to-walk p0-3 s0) 49)
	(= (time-to-walk s3 p0-3) 99)
	(= (time-to-walk p0-3 s3) 99)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 58)
	(= (time-to-walk p1-0 s1) 58)
	(= (time-to-walk s0 p1-0) 22)
	(= (time-to-walk p1-0 s0) 22)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 34)
	(= (time-to-walk p2-3 s2) 34)
	(= (time-to-walk s3 p2-3) 17)
	(= (time-to-walk p2-3 s3) 17)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 43)
	(= (time-to-walk p2-4 s2) 43)
	(= (time-to-walk s4 p2-4) 78)
	(= (time-to-walk p2-4 s4) 78)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 83)
	(= (time-to-walk p3-1 s3) 83)
	(= (time-to-walk s1 p3-1) 75)
	(= (time-to-walk p3-1 s1) 75)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 61)
	(= (time-to-drive s1 s0) 61)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 60)
	(= (time-to-drive s2 s0) 60)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 70)
	(= (time-to-drive s3 s1) 70)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 64)
	(= (time-to-drive s0 s3) 64)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 5)
	(= (time-to-drive s2 s3) 5)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 70)
	(= (time-to-drive s4 s3) 70)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 45)
	(= (time-to-drive s1 s4) 45)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 92)
	(= (time-to-drive s2 s4) 92)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver3 s0)
	(at driver4 s3)
	(at driver5 s2)
	(at truck2 s1)
	(at truck4 s4)
	(at truck6 s3)
	(at package1 s3)
	(at package3 s4)
	(at package4 s1)
	(at package5 s2)
	(at package6 s2)
	(at package7 s0)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 3  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver4 truck6 s2)
   deleted: (at driver4 s2) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 5 of 13
2. (walk driver3 s3 p0-3)
   deleted: (at driver3 s3)
   added: (at driver3 p0-3)
   changed: (walked) from 0 to 99
   goals met: 5 of 13
3. (walk driver3 p0-3 s0)
   deleted: (at driver3 p0-3)
   added: (at driver3 s0)
   changed: (walked) from 99 to 148
   goals met: 6 of 13
4. (drive-truck truck6 s2 s3 driver4)
   deleted: (at truck6 s2)
   added: (at truck6 s3)
   changed: (driven) from 0 to 5
   goals met: 7 of 13
5. (load-truck package5 truck6 s3)
   deleted: (at package5 s3)
   added: (in package5 truck6)
   goals met: 7 of 13
6. (drive-truck truck6 s3 s2 driver4)
   deleted: (at truck6 s3)
   added: (at truck6 s2)
   changed: (driven) from 5 to 10
   goals met: 6 of 13
7. (unload-truck package5 truck6 s2)
   deleted: (in package5 truck6)
   added: (at package5 s2)
   goals met: 7 of 13
8. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 6 of 13
9. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 10 to 71
   goals met: 7 of 13
10. (drive-truck truck6 s2 s4 driver4)
   deleted: (at truck6 s2)
   added: (at truck6 s4)
   changed: (driven) from 71 to 163
   goals met: 7 of 13
11. (load-truck package1 truck6 s4)
   deleted: (at package1 s4)
   added: (in package1 truck6)
   goals met: 7 of 13
12. (load-truck package6 truck6 s4)
   deleted: (at package6 s4)
   added: (in package6 truck6)
   goals met: 7 of 13
13. (load-truck package7 truck2 s1)
   deleted: (at package7 s1)
   added: (in package7 truck2)
   goals met: 7 of 13
14. (drive-truck truck2 s1 s0 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (driven) from 163 to 224
   goals met: 6 of 13
15. (unload-truck package7 truck2 s0)
   deleted: (in package7 truck2)
   added: (at package7 s0)
   goals met: 7 of 13
16. (disembark-truck driver3 truck2 s0)
   deleted: (driving driver3 truck2)
   added: (at driver3 s0) (empty truck2)
   goals met: 8 of 13
17. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 7 of 13
18. (drive-truck truck6 s4 s3 driver4)
   deleted: (at truck6 s4)
   added: (at truck6 s3)
   changed: (driven) from 224 to 294
   goals met: 8 of 13
19. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 294 to 355
   goals met: 9 of 13
20. (disembark-truck driver4 truck6 s3)
   deleted: (driving driver4 truck6)
   added: (at driver4 s3) (empty truck6)
   goals met: 10 of 13
21. (unload-truck package6 truck6 s3)
   deleted: (in package6 truck6)
   added: (at package6 s3)
   goals met: 10 of 13
22. (drive-truck truck2 s1 s0 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (driven) from 355 to 416
   goals met: 9 of 13
23. (board-truck driver4 truck6 s3)
   deleted: (at driver4 s3) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 8 of 13
24. (unload-truck package1 truck6 s3)
   deleted: (in package1 truck6)
   added: (at package1 s3)
   goals met: 9 of 13
25. (drive-truck truck6 s3 s2 driver4)
   deleted: (at truck6 s3)
   added: (at truck6 s2)
   changed: (driven) from 416 to 421
   goals met: 8 of 13
26. (drive-truck truck2 s0 s3 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (driven) from 421 to 485
   goals met: 8 of 13
27. (drive-truck truck6 s2 s3 driver4)
   deleted: (at truck6 s2)
   added: (at truck6 s3)
   changed: (driven) from 485 to 490
   goals met: 9 of 13
28. (load-truck package6 truck2 s3)
   deleted: (at package6 s3)
   added: (in package6 truck2)
   goals met: 9 of 13
29. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (driven) from 490 to 554
   goals met: 9 of 13
30. (disembark-truck driver1 truck2 s0)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 10 of 13
31. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 9 of 13
32. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 554 to 615
   goals met: 10 of 13
33. (unload-truck package6 truck2 s1)
   deleted: (in package6 truck2)
   added: (at package6 s1)
   goals met: 10 of 13
34. (disembark-truck driver4 truck6 s3)
   deleted: (driving driver4 truck6)
   added: (at driver4 s3) (empty truck6)
   goals met: 11 of 13
35. (drive-truck truck2 s1 s0 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (driven) from 615 to 676
   goals met: 10 of 13
36. (disembark-truck driver3 truck2 s0)
   deleted: (driving driver3 truck2)
   added: (at driver3 s0) (empty truck2)
   goals met: 11 of 13
37. (board-truck driver3 truck1 s0)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 10 of 13
38. (drive-truck truck1 s0 s1 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (driven) from 676 to 737
   goals met: 10 of 13
39. (load-truck package6 truck1 s1)
   deleted: (at package6 s1)
   added: (in package6 truck1)
   goals met: 10 of 13
40. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (driven) from 737 to 798
   goals met: 10 of 13
41. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 11 of 13
42. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 10 of 13
43. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 9 of 13
44. (disembark-truck driver3 truck2 s0)
   deleted: (driving driver3 truck2)
   added: (at driver3 s0) (empty truck2)
   goals met: 10 of 13
45. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 798 to 858
   goals met: 10 of 13
46. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 10 of 13
47. (drive-truck truck2 s0 s1 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 858 to 919
   goals met: 11 of 13
48. (unload-truck package6 truck1 s2)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   goals met: 12 of 13
49. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 919 to 979
   goals met: 12 of 13
50. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 13 of 13
